namespace Cloudland.APM.DTO.NodeObjects;

public enum TableButtonEventsType
{
    خالی = 0,
    اجرای_رویداد = 1,
    اجرای_وب_سرویس = 2,
    ارسال_ایمیل = 3,
    انتقال_فایل = 4,
    باز_کردن_فرم = 5,
    باز_کردن_فرم_فقط_خواندنی = 6,
    نمایش_ضمیمه = 7,
    باز_کردن_فرم_به_صورت_ویرایش = 8,
    تولید_کلید_عمومی_مالیاتی = 9,
    بروزرسانی_کالا_مالیات = 10,
    ارسال_صورتحساب_به_سامانه_مودیان = 11,
    باز_کردن_فرم_با_لینک = 12,
    باز_کردن_فرم_به_صورت_ویرایش_با_لینک = 13,
    نمایش_گزارش = 15,
    پرینت_گزارش = 16
}